In [ ]:
!pip install pandas

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
data = [10, 20, 30, 40, 50]

series = pd.Series(data, index=['a', 'b', 'c', 'd', 'e'])

In [4]:
series

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [5]:
type(series)

pandas.core.series.Series

In [6]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana'],
    'Age': [25, 30, 35, 28],
    'City': ['New York', 'London', 'Tokyo', 'Paris'],
    'Salary': [70000, 80000, 90000, 75000]
}

In [7]:
data

{'Name': ['Alice', 'Bob', 'Charlie', 'Diana'],
 'Age': [25, 30, 35, 28],
 'City': ['New York', 'London', 'Tokyo', 'Paris'],
 'Salary': [70000, 80000, 90000, 75000]}

In [8]:
df = pd.DataFrame(data)

In [9]:
df

      Name  Age      City  Salary
0    Alice   25  New York   70000
1      Bob   30    London   80000
2  Charlie   35     Tokyo   90000
3    Diana   28     Paris   75000

In [10]:
type(df)

pandas.core.frame.DataFrame

In [12]:
type(df.Name)

pandas.core.series.Series

In [16]:
type(df[["Name", "Age"]])

pandas.core.frame.DataFrame

In [17]:
np.random.seed(42)
df = pd.DataFrame({
    'A': np.random.randn(100),
    'B': np.random.randint(1, 10, 100),
    'C': np.random.choice(['X', 'Y', 'Z'], 100),
    'D': pd.date_range('2023-01-01', periods=100, freq='D'),
    'E': np.random.randn(100) * 100
})

In [18]:
df

           A  B  C          D           E
0   0.496714  9  Y 2023-01-01   23.229616
1  -0.138264  5  Y 2023-01-02   17.618092
2   0.647689  1  Y 2023-01-03 -115.256537
3   1.523030  3  Y 2023-01-04 -150.076839
4  -0.234153  8  Z 2023-01-05   16.502280
..       ... .. ..        ...         ...
95 -1.463515  3  Z 2023-04-06   94.914299
96  0.296120  9  X 2023-04-07  -23.922480
97  0.261055  3  X 2023-04-08   85.397471
98  0.005113  9  X 2023-04-09  -27.104046
99 -0.234587  2  Y 2023-04-10  -61.309468

[100 rows x 5 columns]

In [19]:
df.shape

(100, 5)

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       100 non-null    float64
 1   B       100 non-null    int32
 2   C       100 non-null    object
 3   D       100 non-null    datetime64[ns]
 4   E       100 non-null    float64
dtypes: datetime64[ns](1), float64(2), int32(1), object(1)
memory usage: 3.6+ KB

In [21]:
df.dtypes

A           float64
B             int32
C            object
D    datetime64[ns]
E           float64
dtype: object

In [24]:
df.columns

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [26]:
df.head(20)

           A  B  C          D           E
0   0.496714  9  Y 2023-01-01   23.229616
1  -0.138264  5  Y 2023-01-02   17.618092
2   0.647689  1  Y 2023-01-03 -115.256537
3   1.523030  3  Y 2023-01-04 -150.076839
4  -0.234153  8  Z 2023-01-05   16.502280
5  -0.234137  6  X 2023-01-06  -85.592892
6   1.579213  8  X 2023-01-07   -3.963614
7   0.767435  9  X 2023-01-08  -53.466274
8  -0.469474  4  X 2023-01-09 -178.849650
9   0.542560  1  Y 2023-01-10   35.730454
10 -0.463418  1  X 2023-01-11  -41.453181
11 -0.465730  4  Z 2023-01-12    8.019871
12  0.241962  7  Z 2023-01-13  -89.312027
13 -1.913280  2  X 2023-01-14  -33.481725
14 -1.724918  3  X 2023-01-15  156.038014
15 -0.562288  1  Z 2023-01-16   12.855100
16 -1.012831  5  Z 2023-01-17   54.957635
17  0.314247  1  Y 2023-01-18 -127.087181
18 -0.908024  8  Z 2023-01-19  238.903596
19 -1.412304  1  Y 2023-01-20  184.341376

In [28]:
df.tail(10)

           A  B  C          D          E
90  0.097078  8  Z 2023-04-01 -40.791535
91  0.968645  4  Y 2023-04-02  26.162306
92 -0.702053  6  X 2023-04-03   1.214651
93 -0.327662  8  X 2023-04-04  93.093408
94 -0.392108  4  Y 2023-04-05 -52.318809
95 -1.463515  3  Z 2023-04-06  94.914299
96  0.296120  9  X 2023-04-07 -23.922480
97  0.261055  3  X 2023-04-08  85.397471
98  0.005113  9  X 2023-04-09 -27.104046
99 -0.234587  2  Y 2023-04-10 -61.309468

In [33]:
df.sample(5)

           A  B  C          D           E
26 -1.150994  1  Y 2023-01-27  -44.449874
47  1.057122  3  X 2023-02-17  -10.511850
67  1.003533  3  Y 2023-03-09    7.097242
87  0.328751  8  Y 2023-03-29  116.193732
58  0.331263  8  X 2023-02-28  -20.245753

In [34]:
df.size

500

In [35]:
df.describe()

                A           B                    D           E
count  100.000000  100.000000                  100  100.000000
mean    -0.103847    4.730000  2023-02-19 12:00:00    8.073564
min     -2.619745    1.000000  2023-01-01 00:00:00 -199.496157
25%     -0.600906    2.000000  2023-01-25 18:00:00  -61.360443
50%     -0.126956    4.000000  2023-02-19 12:00:00    3.682609
75%      0.405952    7.000000  2023-03-16 06:00:00   85.966970
max      1.852278    9.000000  2023-04-10 00:00:00  238.903596
std      0.908168    2.733463                  NaN  101.447471

In [37]:
df.describe(include="all").T

,count,unique,top,freq,mean,min,25%,50%,75%,max,std
A,100.0,NaN,NaN,NaN,-0.103847,-2.619745,-0.600906,-0.126956,0.405952,1.852278,0.908168
B,100.0,NaN,NaN,NaN,4.73,1.0,2.0,4.0,7.0,9.0,2.733463
C,100,3,X,36,NaN,NaN,NaN,NaN,NaN,NaN,NaN
D,100,NaN,NaN,NaN,2023-02-19 12:00:00,2023-01-01 00:00:00,2023-01-25 18:00:00,2023-02-19 12:00:00,2023-03-16 06:00:00,2023-04-10 00:00:00,NaN
E,100.0,NaN,NaN,NaN,8.073564,-199.496157,-61.360443,3.682609,85.96697,238.903596,101.447471

In [39]:
df.T

,0,1,2,3,4,5,6,7,8,9,...,90,91,92,93,94,95,96,97,98,99
A,0.496714,-0.138264,0.647689,1.52303,-0.234153,-0.234137,1.579213,0.767435,-0.469474,0.54256,...,0.097078,0.968645,-0.702053,-0.327662,-0.392108,-1.463515,0.29612,0.261055,0.005113,-0.234587
B,9,5,1,3,8,6,8,9,4,1,...,8,4,6,8,4,3,9,3,9,2
C,Y,Y,Y,Y,Z,X,X,X,X,Y,...,Z,Y,X,X,Y,Z,X,X,X,Y
D,2023-01-01 00:00:00,2023-01-02 00:00:00,2023-01-03 00:00:00,2023-01-04 00:00:00,2023-01-05 00:00:00,2023-01-06 00:00:00,2023-01-07 00:00:00,2023-01-08 00:00:00,2023-01-09 00:00:00,2023-01-10 00:00:00,...,2023-04-01 00:00:00,2023-04-02 00:00:00,2023-04-03 00:00:00,2023-04-04 00:00:00,2023-04-05 00:00:00,2023-04-06 00:00:00,2023-04-07 00:00:00,2023-04-08 00:00:00,2023-04-09 00:00:00,2023-04-10 00:00:00
E,23.229616,17.618092,-115.256537,-150.076839,16.50228,-85.592892,-3.963614,-53.466274,-178.84965,35.730454,...,-40.791535,26.162306,1.214651,93.093408,-52.318809,94.914299,-23.92248,85.397471,-27.104046,-61.309468

In [41]:
df["C"].unique()

array(['Y', 'Z', 'X'], dtype=object)

In [42]:
df["B"].unique()

array([9, 5, 1, 3, 8, 6, 4, 7, 2])

In [44]:
df["B"].value_counts()

B
1    17
3    13
4    13
8    12
9    11
6     9
7     9
2     9
5     7
Name: count, dtype: int64

In [46]:
df1 = df.copy()

In [47]:
df1

           A  B  C          D           E
0   0.496714  9  Y 2023-01-01   23.229616
1  -0.138264  5  Y 2023-01-02   17.618092
2   0.647689  1  Y 2023-01-03 -115.256537
3   1.523030  3  Y 2023-01-04 -150.076839
4  -0.234153  8  Z 2023-01-05   16.502280
..       ... .. ..        ...         ...
95 -1.463515  3  Z 2023-04-06   94.914299
96  0.296120  9  X 2023-04-07  -23.922480
97  0.261055  3  X 2023-04-08   85.397471
98  0.005113  9  X 2023-04-09  -27.104046
99 -0.234587  2  Y 2023-04-10  -61.309468

[100 rows x 5 columns]

In [48]:
df

           A  B  C          D           E
0   0.496714  9  Y 2023-01-01   23.229616
1  -0.138264  5  Y 2023-01-02   17.618092
2   0.647689  1  Y 2023-01-03 -115.256537
3   1.523030  3  Y 2023-01-04 -150.076839
4  -0.234153  8  Z 2023-01-05   16.502280
..       ... .. ..        ...         ...
95 -1.463515  3  Z 2023-04-06   94.914299
96  0.296120  9  X 2023-04-07  -23.922480
97  0.261055  3  X 2023-04-08   85.397471
98  0.005113  9  X 2023-04-09  -27.104046
99 -0.234587  2  Y 2023-04-10  -61.309468

[100 rows x 5 columns]

In [49]:
df.index

RangeIndex(start=0, stop=100, step=1)

In [50]:
print(df['A'].mean())       # Mean

-0.10384651739409384

In [51]:
print(df['A'].mode())

0    -2.619745
1    -1.987569
2    -1.959670
3    -1.913280
4    -1.763040
        ...
95    1.523030
96    1.538037
97    1.564644
98    1.579213
99    1.852278
Name: A, Length: 100, dtype: float64

In [54]:
df['B'].mode()

0    1
Name: B, dtype: int32

In [55]:
df[["A", "B", "E"]].mean()

A   -0.103847
B    4.730000
E    8.073564
dtype: float64

In [57]:
df1.isnull().sum()

A    0
B    0
C    0
D    0
E    0
dtype: int64

In [58]:
df1.isnull().sum().sum()

0

In [59]:
df1.isna().sum()

A    0
B    0
C    0
D    0
E    0
dtype: int64

In [60]:
df1["A"].isnull().sum()

0

In [61]:
print(df1.notnull().sum())

A    100
B    100
C    100
D    100
E    100
dtype: int64

In [62]:
df1

           A  B  C          D           E
0   0.496714  9  Y 2023-01-01   23.229616
1  -0.138264  5  Y 2023-01-02   17.618092
2   0.647689  1  Y 2023-01-03 -115.256537
3   1.523030  3  Y 2023-01-04 -150.076839
4  -0.234153  8  Z 2023-01-05   16.502280
..       ... .. ..        ...         ...
95 -1.463515  3  Z 2023-04-06   94.914299
96  0.296120  9  X 2023-04-07  -23.922480
97  0.261055  3  X 2023-04-08   85.397471
98  0.005113  9  X 2023-04-09  -27.104046
99 -0.234587  2  Y 2023-04-10  -61.309468

[100 rows x 5 columns]

In [68]:
df1.loc[10:90:10, ["A", "C"]]

           A  C
10 -0.463418  X
20  1.465649  Y
30 -0.601707  X
40  0.738467  X
50  0.324084  X
60 -0.479174  X
70  0.361396  Y
80 -0.219672  X
90  0.097078  Z

In [70]:
df1.iloc[10:100:10, 0:4]

           A  B  C          D
10 -0.463418  1  X 2023-01-11
20  1.465649  1  Y 2023-01-21
30 -0.601707  5  X 2023-01-31
40  0.738467  4  X 2023-02-10
50  0.324084  3  X 2023-02-20
60 -0.479174  2  X 2023-03-02
70  0.361396  4  Y 2023-03-12
80 -0.219672  3  X 2023-03-22
90  0.097078  8  Z 2023-04-01

In [72]:
data = pd.read_csv("F:\\Dataset\\onlineretails.csv")

In [74]:
data1 = pd.read_csv("https://raw.githubusercontent.com/Amitmakode/X_DSAAI_B4/refs/heads/main/Python/25.%20saless.csv?token=GHSAT0AAAAAADN6CAG2LH42OTCRM3IRYMRY2IBXLYQ")

In [75]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 10 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  object
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   541909 non-null  float64
 7   Country      541909 non-null  object
 8   Data_copy    541909 non-null  object
 9   descrip      540455 non-null  object
dtypes: float64(2), int64(1), object(7)
memory usage: 41.3+ MB

In [76]:
data.isnull().sum()

InvoiceNo         0
StockCode         0
Description    1454
Quantity          0
InvoiceDate       0
UnitPrice         0
CustomerID        0
Country           0
Data_copy         0
descrip        1454
dtype: int64

In [79]:
data = pd.read_csv("F:\\Dataset\\messy_vehicle_sales_data.xls")

In [80]:
data.shape

(2000000, 54)

In [81]:
data.head()

,Transaction_ID,Sale_Date,Manufacturer,Model,Production_Year,Vehicle_Type,Fuel_Type,Engine_Size,Horsepower,Torque,...,Curb_Weight_kg,Towing_Capacity_kg,Interior_Material,Exterior_Color,Number_of_Airbags,Software_Update_Capability,Regional_Tax_Rate,Charging_Infrastructure_Score,Tariff_Impact_Pct,Consumer_Demand_Index
0,TXN0,12/07/2021,Ford,ModelX,2017.0,@@@,??,NaN,150 hp,NaN,...,NaN,2000.0,Vinyl,Red,6.0,No,10.0,NaN,NaN,999.0
1,TXN1,NaN,Ford,ModelX,2019.0,123,??,2.0L,200HP,280 newton,...,NaN,2000.0,NaN,Blue,4.0,Yes,NaN,NaN,5.0,NaN
2,TXN2##,12/07/2021,BMW,Civic,2019.0,Sedan,Petrol,3.5L,220 horsepower,300Nm,...,1800kg,1000.0,Fabric,??,NaN,No,NaN,NaN,5.0,999.0
3,TXN3,"July 12, 2021",Hyundai,Corolla,NaN,Coupe,NaN,NaN,220 horsepower,280 newton,...,1500,1000.0,Fabric,NaN,8.0,Yes,10.0,70.0,999.0,NaN
4,TXN4ERR,2021-07-12,Hyundai,Civic,2019.0,SUV,Electric,NaN,150 hp,300Nm,...,NaN,2000.0,Leather,Red,4.0,No,5.0,50.0,15.0,50.0

In [83]:
data.isnull().sum().sum()

25739006

In [84]:
data.size

108000000